## 모듈 import

In [4]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (1.26.1)

[notice] A new release of pip is available: 23.2.1 -> 23.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
!pip install pandas

Collecting pandas
  Obtaining dependency information for pandas from https://files.pythonhosted.org/packages/f0/9b/f5218b4d746491bf262f74665f17604de88387173127ce0ed1eabcddf754/pandas-2.1.2-cp312-cp312-win_amd64.whl.metadata
  Downloading pandas-2.1.2-cp312-cp312-win_amd64.whl.metadata (18 kB)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Obtaining dependency information for pytz>=2020.1 from https://files.pythonhosted.org/packages/32/4d/aaf7eff5deb402fd9a24a1449a8119f00d74ae9c2efa79f8ef9994261fc2/pytz-2023.3.post1-py2.py3-none-any.whl.metadata
  Downloading pytz-2023.3.post1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.1 (from pandas)
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     ---------------------------------------- 0.0/341.8 kB ? eta -:--:--
     ------- ------------------------------- 61.4/341.8 kB 3.4 MB/s eta 0:00:01
     ------- ------------------------------- 61.4/341.8 kB 3.4 MB/s eta 0:00:01
     -------- ---------------------------- 81.9/341.8 kB 383.3 kB/s eta 0:00:01
     -------------------------------------  337.9/341.8 kB 1.3 MB/s eta 0:00:01
     -------------------------------------- 341.8/341.8 kB 1.1 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.1.2-cp312-cp312-win_amd64.whl (10.5 MB)
   ---------------------------------------- 0.0/10.5 MB ? eta -:--:--
    --------------------------------------- 0.3/10.5 MB 7.7 MB/s eta 0:00:02
   - -------------------------------------- 0.4/10.5 MB 6.8 MB/s eta 0:00:02
   - -------------------------------------- 0.4/10.5 MB 6.8 MB/s eta 0:00:02
   - -------------------------------------- 0.4/10.5 MB 6.8 MB/s eta 0:00:02
   - -------------------------------------- 0.4/10.5 MB 6.8 MB/s eta 0:00:02
   - -------------------------------------- 0.4/10.5 MB 6.8 MB/s eta 0:00:02
   -- ------------------------------------- 0.7/10.5 MB 2.2 MB/s eta 0:00:05
   --- ------------------------------------ 0.9/10.5 MB 2.5 MB/s eta 0:00:04
   ---- ----------------------------------- 1.1/10.5 MB 2.8 MB/s eta 0:00:04
   ------ --------------------------------- 1.6/10.5 MB 3.6 MB/s eta 0:00:03
   ------- -------------------------------- 1.9/10.5 MB 3.8 MB/s eta 0:00:03
   --------- ------------------------------ 2.4/10.5 MB 4.4 MB/s eta 0:00:02
   ---------- ----------------------------- 2.7/10.5 MB 4.5 MB/s eta 0:00:02
   ---------- ----------------------------- 2.8/10.5 MB 4.5 MB/s eta 0:00:02
   ------------ --------------------------- 3.3/10.5 MB 4.6 MB/s eta 0:00:02
   -------------- ------------------------- 3.8/10.5 MB 5.0 MB/s eta 0:00:02
   ---------------- ----------------------- 4.3/10.5 MB 5.2 MB/s eta 0:00:02
   ----------------- ---------------------- 4.5/10.5 MB 5.2 MB/s eta 0:00:02
   ----------------- ---------------------- 4.6/10.5 MB 5.1 MB/s eta 0:00:02
   ------------------- -------------------- 5.1/10.5 MB 5.2 MB/s eta 0:00:02
   -------------------- ------------------- 5.4/10.5 MB 5.2 MB/s eta 0:00:01
   -------------------- ------------------- 5.5/10.5 MB 5.0 MB/s eta 0:00:02
   --------------------- ------------------ 5.8/10.5 MB 5.0 MB/s eta 0:00:01
   ---------------------- ----------------- 5.9/10.5 MB 5.0 MB/s eta 0:00:01
   ----------------------- ---------------- 6.1/10.5 MB 4.8 MB/s eta 0:00:01
   ------------------------ --------------- 6.3/10.5 MB 4.7 MB/s eta 0:00:01
   ------------------------ --------------- 6.5/10.5 MB 4.5 MB/s eta 0:00:01
   ------------------------- -------------- 6.8/10.5 MB 4.6 MB/s eta 0:00:01
   --------------------------- ------------ 7.1/10.5 MB 4.6 MB/s eta 0:00:01
   --------------------------- ------------ 7.3/10.5 MB 4.5 MB/s eta 0:00:01
   ----------------------------- ---------- 7.8/10.5 MB 4.7 MB/s eta 0:00:01
   -------------------------------- ------- 8.4/10.5 MB 4.9 MB/s eta 0:00:01
   --------------------------------- ------ 8.8/10.5 MB 5.0 MB/s eta 0:00:01
   ---------------------------------- ----- 9.0/10.5 MB 5.0 MB/s eta 0:00:01
   ----------------------------------- ---- 9.3/10.5 MB 4.9 MB/s eta 0:00:01
   ------------------------------------ --- 9.5/10.5 MB 4.9 MB/s eta 0:00:01
   ------------------------------------- -- 9.9/10.5 MB 4.9 MB/s eta 0:00:01
   -------------------------------------- - 10.2/10.5 MB 5.0 MB/s eta 0:00:01
   ---------------------------------------  10.3/10.5 MB 4.9 MB/s eta 0:00:01
   ---------------------------------------  10.5/10.5 MB 4.9 MB/s eta 0:00:01
   ---------------------------------------  10.5/10.5 MB 4.9 MB/s eta 0:00:01
   ---------------------------------------  10.5/10.5 MB 4.9 MB/s eta 0:00:01
   ---------------------------------------- 10.5/10.5 MB 4.5 MB/s eta 0:00:00
Downloading pytz-2023.3.post1-py2.py3-none-any.whl (502 kB)
   ---------------------------------------- 0.0/502.5 kB ? eta -:--:--
   --------- ------------------------------ 122.9/502.5 kB ? eta -:--:--
   --------------- ------------------------ 194.6/502.5 kB 2.9 MB/s eta 0:00:01
   ---------------- ----------------------- 204.8/502.5 kB 1.8 MB/s eta 0:00:01
   ---------------------------------------  501.8/502.5 kB 2.9 MB/s eta 0:00:01
   ---------------------------------------- 502.5/502.5 kB 2.2 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.1.2 pytz-2023.3.post1 tzdata-2023.3

[notice] A new release of pip is available: 23.2.1 -> 23.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
!pip install seaborn

Collecting seaborn
  Obtaining dependency information for seaborn from https://files.pythonhosted.org/packages/7b/e5/83fcd7e9db036c179e0352bfcd20f81d728197a16f883e7b90307a88e65e/seaborn-0.13.0-py3-none-any.whl.metadata
  Downloading seaborn-0.13.0-py3-none-any.whl.metadata (5.3 kB)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (1.26.1)
Requirement already satisfied: pandas>=1.2 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (2.1.2)
Collecting matplotlib!=3.6.1,>=3.3 (from seaborn)
  Obtaining dependency information for matplotlib!=3.6.1,>=3.3 from https://files.pythonhosted.org/packages/59/c7/f8da659997fe3210fdda689cf2d7720b3a079578fb8aecc3623c4e091a77/matplotlib-3.8.0-cp312-cp312-win_amd64.whl.metadata
  Downloading matplotlib-3.8.0-cp312-cp312-win_amd64.whl.metadata (5.9 kB)
Collecting contourpy>=1.0.1 (from matplotlib!=3.6.1,>=3.3->seaborn)
  Obtaining dependency information for contourpy>=1.0.1 from https://files.pythonhosted.org/packages/75/d4/c3b7a9a0d1f99b528e5a46266b0b9f13aad5a0dd1156d071418df314c427/contourpy-1.1.1-cp312-cp312-win_amd64.whl.metadata
  Downloading contourpy-1.1.1-cp312-cp312-win_amd64.whl.metadata (5.9 kB)
Collecting cycler>=0.10 (from matplotlib!=3.6.1,>=3.3->seaborn)
  Obtaining dependency information for cycler>=0.10 from https://files.pythonhosted.org/packages/e7/05/c19819d5e3d95294a6f5947fb9b9629efb316b96de511b418c53d245aae6/cycler-0.12.1-py3-none-any.whl.metadata
  Downloading cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib!=3.6.1,>=3.3->seaborn)
  Obtaining dependency information for fonttools>=4.22.0 from https://files.pythonhosted.org/packages/24/01/9bb5e115206b5c7f7894978f9af57a3d17c94fbc0df913389f1eaf334a68/fonttools-4.43.1-cp312-cp312-win_amd64.whl.metadata
  Downloading fonttools-4.43.1-cp312-cp312-win_amd64.whl.metadata (155 kB)
     ---------------------------------------- 0.0/155.5 kB ? eta -:--:--
     ------- -------------------------------- 30.7/155.5 kB ? eta -:--:--
     --------------------------- ---------- 112.6/155.5 kB 1.7 MB/s eta 0:00:01
     -------------------------------------- 155.5/155.5 kB 1.9 MB/s eta 0:00:00
Collecting kiwisolver>=1.0.1 (from matplotlib!=3.6.1,>=3.3->seaborn)
  Obtaining dependency information for kiwisolver>=1.0.1 from https://files.pythonhosted.org/packages/63/50/2746566bdf4a6a842d117367d05c90cfb87ac04e9e2845aa1fa21f071362/kiwisolver-1.4.5-cp312-cp312-win_amd64.whl.metadata
  Downloading kiwisolver-1.4.5-cp312-cp312-win_amd64.whl.metadata (6.5 kB)
Requirement already satisfied: packaging>=20.0 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (23.2)
Collecting pillow>=6.2.0 (from matplotlib!=3.6.1,>=3.3->seaborn)
  Obtaining dependency information for pillow>=6.2.0 from https://files.pythonhosted.org/packages/32/e4/978865107d097dd9cb650331676d8dc29ed9fcd0aaab46486e9d6e5123f0/Pillow-10.1.0-cp312-cp312-win_amd64.whl.metadata
  Downloading Pillow-10.1.0-cp312-cp312-win_amd64.whl.metadata (9.6 kB)
Collecting pyparsing>=2.3.1 (from matplotlib!=3.6.1,>=3.3->seaborn)
  Obtaining dependency information for pyparsing>=2.3.1 from https://files.pythonhosted.org/packages/39/92/8486ede85fcc088f1b3dba4ce92dd29d126fd96b0008ea213167940a2475/pyparsing-3.1.1-py3-none-any.whl.metadata
  Downloading pyparsing-3.1.1-py3-none-any.whl.metadata (5.1 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.3->seaborn) (1.16.0)
Downloading seaborn-0.13.0-py3-none-any.whl (294 kB)
   ---------------------------------------- 0.0/294.6 kB ? eta -:--:--
   -------------------------------------- - 286.7/294.6 kB 8.9 MB/s eta 0:00:01
   ---------------------------------------- 294.6/294.6 kB 6.0 MB/s eta 0:00:00
Downloading matplotlib-3.8.0-cp312-cp312-win_amd64.whl (7.6 MB)
   ---------------------------------------- 0.0/7.6 MB ? eta -:--:--
    --------------------------------------- 0.2/7.6 MB ? eta -:--:--
    --------------------------------------- 0.2/7.6 MB ? eta -:--:--
    --------------------------------------- 0.2/7.6 MB ? eta -:--:--
    --------------------------------------- 0.2/7.6 MB ? eta -:--:--
    --------------------------------------- 0.2/7.6 MB ? eta -:--:--
    --------------------------------------- 0.2/7.6 MB ? eta -:--:--
    --------------------------------------- 0.2/7.6 MB ? eta -:--:--
   -- ------------------------------------- 0.5/7.6 MB 1.5 MB/s eta 0:00:05
   -- ------------------------------------- 0.5/7.6 MB 1.4 MB/s eta 0:00:06
   --- ------------------------------------ 0.6/7.6 MB 1.5 MB/s eta 0:00:05
   ------ --------------------------------- 1.2/7.6 MB 2.5 MB/s eta 0:00:03
   ------ --------------------------------- 1.2/7.6 MB 2.4 MB/s eta 0:00:03
   -------- ------------------------------- 1.7/7.6 MB 3.0 MB/s eta 0:00:03
   ---------- ----------------------------- 2.0/7.6 MB 3.3 MB/s eta 0:00:02
   ----------- ---------------------------- 2.3/7.6 MB 3.6 MB/s eta 0:00:02
   ------------- -------------------------- 2.6/7.6 MB 3.9 MB/s eta 0:00:02
   --------------- ------------------------ 2.9/7.6 MB 4.0 MB/s eta 0:00:02
   ---------------- ----------------------- 3.2/7.6 MB 4.2 MB/s eta 0:00:02
   ------------------ --------------------- 3.6/7.6 MB 4.4 MB/s eta 0:00:01
   -------------------- ------------------- 4.0/7.6 MB 4.7 MB/s eta 0:00:01
   ---------------------- ----------------- 4.3/7.6 MB 4.8 MB/s eta 0:00:01
   ------------------------ --------------- 4.6/7.6 MB 4.9 MB/s eta 0:00:01
   -------------------------- ------------- 5.1/7.6 MB 5.1 MB/s eta 0:00:01
   ---------------------------- ----------- 5.5/7.6 MB 5.3 MB/s eta 0:00:01
   ------------------------------ --------- 5.8/7.6 MB 5.4 MB/s eta 0:00:01
   ------------------------------- -------- 6.1/7.6 MB 5.5 MB/s eta 0:00:01
   --------------------------------- ------ 6.5/7.6 MB 5.6 MB/s eta 0:00:01
   ----------------------------------- ---- 6.7/7.6 MB 5.6 MB/s eta 0:00:01
   ------------------------------------ --- 7.0/7.6 MB 5.7 MB/s eta 0:00:01
   ------------------------------------- -- 7.2/7.6 MB 5.6 MB/s eta 0:00:01
   ---------------------------------------  7.6/7.6 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  7.6/7.6 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------- 7.6/7.6 MB 5.4 MB/s eta 0:00:00
Downloading contourpy-1.1.1-cp312-cp312-win_amd64.whl (486 kB)
   ---------------------------------------- 0.0/486.7 kB ? eta -:--:--
   -------------------------------- ------ 409.6/486.7 kB 12.9 MB/s eta 0:00:01
   --------------------------------------- 486.7/486.7 kB 10.1 MB/s eta 0:00:00
Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.43.1-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ------ --------------------------------- 0.4/2.1 MB 22.4 MB/s eta 0:00:01
   --------- ------------------------------ 0.5/2.1 MB 7.5 MB/s eta 0:00:01
   -------------- ------------------------- 0.8/2.1 MB 7.1 MB/s eta 0:00:01
   ------------------- -------------------- 1.0/2.1 MB 6.5 MB/s eta 0:00:01
   ----------------------------- ---------- 1.6/2.1 MB 7.8 MB/s eta 0:00:01
   ---------------------------------- ----- 1.8/2.1 MB 7.7 MB/s eta 0:00:01
   ---------------------------------------  2.1/2.1 MB 7.5 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 6.8 MB/s eta 0:00:00
Downloading kiwisolver-1.4.5-cp312-cp312-win_amd64.whl (56 kB)
   ---------------------------------------- 0.0/56.0 kB ? eta -:--:--
   ---------------------------------------- 56.0/56.0 kB ? eta 0:00:00
Downloading Pillow-10.1.0-cp312-cp312-win_amd64.whl (2.6 MB)
   ---------------------------------------- 0.0/2.6 MB ? eta -:--:--
   ------- -------------------------------- 0.5/2.6 MB 14.4 MB/s eta 0:00:01
   ----------- ---------------------------- 0.8/2.6 MB 9.7 MB/s eta 0:00:01
   ----------------- ---------------------- 1.1/2.6 MB 10.1 MB/s eta 0:00:01
   ---------------------- ----------------- 1.4/2.6 MB 9.1 MB/s eta 0:00:01
   ------------------------ --------------- 1.6/2.6 MB 8.6 MB/s eta 0:00:01
   ------------------------------ --------- 2.0/2.6 MB 8.4 MB/s eta 0:00:01
   ----------------------------------- ---- 2.3/2.6 MB 8.2 MB/s eta 0:00:01
   ---------------------------------------  2.6/2.6 MB 8.3 MB/s eta 0:00:01
   ---------------------------------------- 2.6/2.6 MB 7.2 MB/s eta 0:00:00
Downloading pyparsing-3.1.1-py3-none-any.whl (103 kB)
   ---------------------------------------- 0.0/103.1 kB ? eta -:--:--
   ---------------------------------------- 103.1/103.1 kB ? eta 0:00:00
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib, seaborn
Successfully installed contourpy-1.1.1 cycler-0.12.1 fonttools-4.43.1 kiwisolver-1.4.5 matplotlib-3.8.0 pillow-10.1.0 pyparsing-3.1.1 seaborn-0.13.0

[notice] A new release of pip is available: 23.2.1 -> 23.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [7]:
from IPython.display import Image
import numpy as np
import pandas as pd
import seaborn as sns

## 데이터셋 로드

In [8]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**컬럼(columns) 설명**

- survivied: 생존여부 (1: 생존, 0: 사망)
- pclass: 좌석 등급 (1등급, 2등급, 3등급)
- sex: 성별
- age: 나이
- sibsp: 형제 + 배우자 수
- parch: 부모 + 자녀 수
- fare: 좌석 요금
- embarked: 탑승 항구 (S, C, Q)
- class: pclass와 동일
- who: 성별과 동일
- adult_male: 성인 남자 여부
- deck: 데크 번호 (알파벳 + 숫자 혼용)
- embark_town: 탑승 항구 이름
- alive: 생존여부 (yes, no)
- alone: 혼자 탑승 여부

## apply() - 함수를 적용

`apply()`는 데이터 전처리시 굉장히 많이 활용하는 기능입니다.

좀 더 복잡한 **logic을 컬럼 혹은 DataFrame에 적용**하고자 할 때 사용합니다.

In [9]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**who** 컬럼에 대하여 man은 남자, woman은 여자, child는 아이로 변경하고자 한다면 apply를 활용하여 해결할 수 있습니다.

In [10]:
df['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

### 함수(function) 정의

In [11]:
def transform_who(x):
    if x == 'man':
        return '남자'
    elif x == 'woman':
        return '여자'
    else:
        return '아이'

In [12]:
df['who'].apply(transform_who)

0      남자
1      여자
2      여자
3      여자
4      남자
       ..
886    남자
887    여자
888    여자
889    남자
890    남자
Name: who, Length: 891, dtype: object

분포를 확인하면 다음과 같습니다.

In [13]:
df['who'].apply(transform_who).value_counts()

who
남자    537
여자    271
아이     83
Name: count, dtype: int64

In [14]:
def transform_who(x):
    return x['fare'] / x['age']

In [15]:
df.apply(transform_who, axis=1)

0      0.329545
1      1.875876
2      0.304808
3      1.517143
4      0.230000
         ...
886    0.481481
887    1.578947
888         NaN
889    1.153846
890    0.242188
Length: 891, dtype: float64

## apply() - lambda 함수

간단한 logic은 함수를 굳이 정의하지 않고, lambda 함수로 쉽게 해결할 수 있습니다.

In [16]:
df['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

**0: 사망, 1: 생존** 으로 변경하도록 하겠습니다.

In [17]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [18]:
df['survived'].apply(lambda x: '생존' if x == 1 else '사망')

0      사망
1      생존
2      생존
3      생존
4      사망
       ..
886    사망
887    생존
888    사망
889    생존
890    사망
Name: survived, Length: 891, dtype: object

In [19]:
df['survived'].apply(lambda x: '생존' if x == 1 else '사망').value_counts()

survived
사망    549
생존    342
Name: count, dtype: int64

## groupby() - 그룹

데이터를 특정 기준으로 그룹핑할 때 활용합니다. 엑셀의 피봇테이블과 유사합니다.

In [20]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

타이타닉 호의 생존자와 사망자를 **성별** 기준으로 그룹핑하여 **평균**을 살펴보겠습니다.

In [22]:
df.groupby('sex').mean(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

`groupby()`를 사용할 때는 반드시 aggregate 하는 **통계함수와 일반적으로 같이 적용**합니다.

### 2개 이상의 컬럼으로 그룹

2개 이상의 컬럼으로 그룹핑할 때도 list로 묶어서 지정하면 됩니다.

In [24]:
# 성별, 좌석등급 별 통계
df.groupby(['sex', 'pclass']).mean(numeric_only=True)

               survived        age     sibsp     parch        fare  \
sex    pclass
female 1       0.968085  34.611765  0.553191  0.457447  106.125798
       2       0.921053  28.722973  0.486842  0.605263   21.970121
       3       0.500000  21.750000  0.895833  0.798611   16.118810
male   1       0.368852  41.281386  0.311475  0.278689   67.226127
       2       0.157407  30.740707  0.342593  0.222222   19.741782
       3       0.135447  26.507589  0.498559  0.224784   12.661633

               adult_male     alone
sex    pclass
female 1         0.000000  0.361702
       2         0.000000  0.421053
       3         0.000000  0.416667
male   1         0.975410  0.614754
       2         0.916667  0.666667
       3         0.919308  0.760807

### 1개의 특정 컬럼에 대한 결과 도출

우리의 주요 관심사는 `survived` 컬럼입니다. 만약 `survived`컬럼에 대한 결과만 도출하고 싶다면 컬럼을 맨 끝에 지정합니다.

In [25]:
# 성별, 좌석등급 별 통계
df.groupby(['sex', 'pclass'])['survived'].mean()

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64

예쁘게 출력하려면 `pd.DataFrame()`으로 감싸주거나, `survived` 컬럼을 []로 한 번 더 감싸주면 됩니다.

In [26]:
# 성별, 좌석등급 별 통계
df.groupby(['sex', 'pclass'])['survived'].mean()

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64

In [27]:
# DataFrame으로 출력
pd.DataFrame(df.groupby(['sex', 'pclass'])['survived'].mean())

               survived
sex    pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [28]:
# DataFrame으로 출력
df.groupby(['sex', 'pclass'])[['survived']].mean()

               survived
sex    pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

### reset_index(): 인덱스 초기화

`reset_index()`: 그룹핑된 데이터프레임의 **index를 초기화**하여 새로운 데이터프레임을 생성합니다.

In [30]:
# index 초기화
df.groupby(['sex', 'pclass'])['survived'].mean().reset_index().sort_values('survived')

      sex  pclass  survived
5    male       3  0.135447
4    male       2  0.157407
3    male       1  0.368852
2  female       3  0.500000
1  female       2  0.921053
0  female       1  0.968085

### 다중 컬럼에 대한 결과 도출

끝에 단일 컬럼이 아닌 여러 개의 컬럼을 지정합니다.

In [31]:
# 성별, 좌석등급 별 통계
df.groupby(['sex', 'pclass'])[['survived', 'age']].mean()

               survived        age
sex    pclass
female 1       0.968085  34.611765
       2       0.921053  28.722973
       3       0.500000  21.750000
male   1       0.368852  41.281386
       2       0.157407  30.740707
       3       0.135447  26.507589

### 다중 통계 함수 적용

여러 가지의 통계 값을 적용할 때는 `agg()`를 사용합니다.

In [32]:
# 성별, 좌석등급 별 통계
df.groupby(['sex', 'pclass'])[['survived', 'age']].agg(['mean', 'sum'])

               survived            age
                   mean sum       mean      sum
sex    pclass
female 1       0.968085  91  34.611765  2942.00
       2       0.921053  70  28.722973  2125.50
       3       0.500000  72  21.750000  2218.50
male   1       0.368852  45  41.281386  4169.42
       2       0.157407  17  30.740707  3043.33
       3       0.135447  47  26.507589  6706.42

**numpy 의 통계 함수도 적용 가능**합니다. (결과는 동일합니다)

In [35]:
# 성별, 좌석등급 별 통계
df.groupby(['sex', 'pclass'])[['survived', 'age']].agg(['mean','sum'])

               survived            age
                   mean sum       mean      sum
sex    pclass
female 1       0.968085  91  34.611765  2942.00
       2       0.921053  70  28.722973  2125.50
       3       0.500000  72  21.750000  2218.50
male   1       0.368852  45  41.281386  4169.42
       2       0.157407  17  30.740707  3043.33
       3       0.135447  47  26.507589  6706.42

## 연습문제

- 남자의 나이는 남자 나이의 평균으로 채우세요
- 여자의 나이는 여자 나이의 평균으로 채우세요

In [40]:
# 실습을 위한 DataFrame copy
df1 = df.copy()

In [41]:
# 결측치 확인
df1['age'].isnull().sum()

0

In [47]:
# 코드를 입력해 주세요
# mean_age_male = df1[df1['sex'] == 'male']['age'].mean()
# mean_age_female = df1[df1['sex'] == 'female']['age'].mean()

# df1['age'] = df1.apply(
#     lambda row: mean_age_male if pd.isnull(row['age']) and row['sex'] == 'male' 
#     else (mean_age_female if pd.isnull(row['age']) and row['sex'] == 'female' 
#           else row['age']), axis=1)


# print(df['age'])


#######
def nan(x):
    mean = x.mean()
    print(mean)
    return x.fillna(mean)


df1.groupby('sex')['age'].apply(nan)

27.91570881226053
30.726644591611475

sex
female  1      38.0
        2      26.0
        3      35.0
        8      27.0
        9      14.0
               ...
male    883    28.0
        884    25.0
        886    27.0
        889    26.0
        890    32.0
Name: age, Length: 891, dtype: float64

<p><strong>[출력 결과]</strong></p><pre>0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...    
886    27.000000
887    19.000000
888    27.915709
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64</pre>

## pivot_table()

피벗테이블은 엑셀의 피벗과 동작이 유사하며, `groupby()`와도 동작이 유사합니다.

기본 동작 원리는 `index`, `columns`, `values`를 지정하여 피벗합니다.

### 1개 그룹에 대한 단일 컬럼 결과

In [48]:
# index에 그룹을 표기
df.pivot_table(index='who', values='survived')

       survived
who
child  0.590361
man    0.163873
woman  0.756458

In [49]:
# columns에 그룹을 표기
df.pivot_table(columns='who', values='survived')

who          child       man     woman
survived  0.590361  0.163873  0.756458

### 다중 그룹에 대한 단일 컬럼 결과

In [50]:
df.pivot_table(index=['who', 'pclass'], values='survived')

              survived
who   pclass
child 1       0.833333
      2       1.000000
      3       0.431034
man   1       0.352941
      2       0.080808
      3       0.119122
woman 1       0.978022
      2       0.909091
      3       0.491228

### index에 컬럼을 중첩하지 않고 행과 열로 펼친 결과

In [51]:
df.pivot_table(index='who', columns='pclass', values='survived')

pclass         1         2         3
who
child   0.833333  1.000000  0.431034
man     0.352941  0.080808  0.119122
woman   0.978022  0.909091  0.491228

### 다중 통계함수 적용

In [52]:
df.pivot_table(index='who', columns='pclass', values='survived', aggfunc=['sum', 'mean'])

       sum              mean
pclass   1   2   3         1         2         3
who
child    5  19  25  0.833333  1.000000  0.431034
man     42   8  38  0.352941  0.080808  0.119122
woman   89  60  56  0.978022  0.909091  0.491228